RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Include/gd32h75e_hpdf.h
/* HPDF_FLTYIDATA */
#define HPDF_FLTYIDATA_ICCH             BITS(0,2)                       /*!< inserted channel most recently converted */
#define HPDF_FLTYIDATA_IDTAT            BITS(8,31)                      /*!< inserted group conversion data */

/* HPDF_FLTYRDATA */
#define HPDF_FLTYRDATA_RCCH             BITS(0,2)                       /*!< regular channel most recently converted */
#define HPDF_FLTYRDATA_RCHPDT           BIT(4)                          /*!< regular channel pending data*/
#define HPDF_FLTYRDATA_RDATA            BITS(8,31)                      /*!< regular channel conversion data */

/* HPDF_FLTYTMHT */
#define HPDF_FLTYTMHT_HTBSD             BITS(0,3)                       /*!< high threshold event break signal distribution */
#define HPDF_FLTYTMHT_HTVAL             BITS(8,31)                      /*!< threshold monitor high threshold value */

/* HPDF_FLTYTMLT */
#define HPDF_FLTYTMLT_LTBSD             BITS(0,3)                       /*!< low threshold event break signal distribution */
#define HPDF_FLTYTMLT_LTVAL             BITS(8,31)                      /*!< threshold monitor low threshold value */

/* HPDF_FLTYTMSTAT */
#define HPDF_FLTYTMSTAT_LTF             BITS(0,7)                       /*!< threshold monitor low threshold flag */
#define HPDF_FLTYTMSTAT_HTF             BITS(8,15)                      /*!< threshold monitor high threshold flag */

/* HPDF_FLTYTMFC */
#define HPDF_FLTYTMFC_LTFC              BITS(0,7)                       /*!< clear the threshold monitor low threshold flag */
#define HPDF_FLTYTMFC_HTFC              BITS(8,15)                      /*!< clear the threshold monitor high threshold flag */

/* HPDF_FLTYEMMAX */
#define HPDF_FLTYEMMAX_MAXDC            BIT(0,2)                        /*!< extremes monitor maximum data channel */
#define HPDF_FLTYEMMAX_MAXVAL           BITS(8,31)                      /*!< extremes monitor maximum value */

/* HPDF_FLTYEMMIN */
#define HPDF_FLTYEMMIN_MINDC            BIT(0,2)                        /*!< extremes monitor minimum data channel */
#define HPDF_FLTYEMMIN_MINVAL           BITS(8,31)                      /*!< extremes monitor minimum value */

/* HPDF_FLTYCT */
#define HPDF_FLTYCT_CTCNT               BIT(4,31)                       /*!< conversion time measured by HPDFCLK */

/* register offset */
#define FLTYCTL1_REG_OFFSET                                   ((uint16_t)0x0004U)        /*!< the offset of FLTYCTL1 register */
#define FLTYSTAT_REG_OFFSET                                   ((uint16_t)0x0008U)        /*!< the offset of FLTYSTAT register */
#define FLTYRDATA_REG_OFFSET                                  ((uint16_t)0x001CU)        /*!< the offset of FLTYRDATA register */
#define FLTYTMSTAT_REG_OFFSET                                 ((uint16_t)0x0028U)        /*!< the offset of FLTYTMSTAT register */

/* HPDF flags and interrupt definitions */
/* define the HPDF bit position and its register index offset */
#define HPDF_FLT0                                             (HPDF + 0x00000100U)
#define HPDF_FLT1                                             (HPDF + 0x00000180U)
#define HPDF_FLT2                                             (HPDF + 0x00000200U)
#define HPDF_FLT3                                             (HPDF + 0x00000280U)
#define HPDF_REGIDX_BIT(regidx, bitpos)                       (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos))
#define HPDF_REG_VAL(regidx, offset)                          (REG32((regidx) + (((uint32_t)(offset) & 0x0000FFC0U) >> 6)))
#define HPDF_BIT_POS(val)                                     ((uint32_t)(val) & 0x0000001FU)
#define HPDF_REGIDX_BIT2(regidx, bitpos, regidx2, bitpos2)    (((uint32_t)(regidx2) << 22) | (uint32_t)((bitpos2) << 16)\
                                                              | (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos)))
#define HPDF_REG_VAL2(regidx, offset)                         (REG32((regidx) + ((uint32_t)(offset) >> 22)))
#define HPDF_BIT_POS2(val)                                    (((uint32_t)(val) & 0x001F0000U) >> 16)

/* constants definitions */
/* parameter struct definitions */
/* channel configuration params */
typedef struct {
    uint32_t data_packing_mode;                 /*!< data packing mode for HPDF_CHXPDI register */
    uint32_t channel_multiplexer;               /*!< channel multiplexer select input data source */
    uint32_t channel_pin_select;                /*!< channel inputs pins selection */
    uint32_t ck_loss_detector;                  /*!< clock loss detector */
    uint32_t malfunction_monitor;               /*!< malfunction monitor */
    uint32_t spi_ck_source;                     /*!< SPI clock source select */
    uint32_t serial_interface;                  /*!< serial interface type */
    int32_t  calibration_offset;                /*!< 24-bit calibration offset */
    uint32_t right_bit_shift;                   /*!< data right bit-shift */
    uint32_t tm_filter;                         /*!< threshold monitor Sinc filter order selection */
    uint32_t tm_filter_oversample;              /*!< threshold monitor filter oversampling rate */
    uint32_t mm_break_signal;                   /*!< malfunction monitor break signal distribution */
    uint32_t mm_counter_threshold;              /*!< malfunction monitor counter threshold */
    uint32_t plsk_value;                        /*!< the number of serial input samples that will be skipped */
} hpdf_channel_parameter_struct;

/* filter configuration params */
typedef struct {
    uint32_t tm_fast_mode;                      /*!< threshold monitor fast mode */
    uint32_t tm_channel;                        /*!< threshold monitor channel */
    int32_t  tm_high_threshold;                 /*!< threshold monitor high threshold */
    int32_t  tm_low_threshold;                  /*!< threshold monitor low threshold value */
    uint32_t extreme_monitor_channel;           /*!< extremes monitor channel */
    uint32_t sinc_filter;                       /*!< sinc filter order */
    uint32_t sinc_oversample;                   /*!< sinc filter oversampling rate */
    uint32_t integrator_oversample;             /*!< integrator oversampling rate */
    uint32_t ht_break_signal;                   /*!< high threshold event break signal distribution */
    uint32_t lt_break_signal;                   /*!< low threshold event break signal distribution */
} hpdf_filter_parameter_struct;

