RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Include/gd32h75e_hpdf.h
/* regular conversions configuration params */
typedef struct {
    uint32_t fast_mode;                         /*!< fast conversion mode enable for regular conversions */
    uint32_t rcs_channel;                       /*!< regular conversion channel */
    uint32_t rcdmaen;                           /*!< DMA channel enabled to read data for the regular conversion */
    uint32_t rcsyn;                             /*!< regular conversion synchronously */
    uint32_t continuous_mode;                   /*!< regular conversions continuous mode */
} hpdf_rc_parameter_struct;

/* inserted conversions configuration params */
typedef struct {
    uint32_t trigger_edge;                      /*!< inserted conversions trigger edge */
    uint32_t trigger_signal;                    /*!< inserted conversions trigger signal */
    uint32_t icdmaen;                           /*!< DMA channel enabled to read data for the inserted channel group */
    uint32_t scmod;                             /*!< scan conversion mode of inserted conversions */
    uint32_t icsyn;                             /*!< inserted conversion synchronously */
    uint32_t ic_channel_group;                  /*!< inserted channel group selection */
} hpdf_ic_parameter_struct;

/* enum definitions */
/* HPDF channel */
typedef enum {
    CHANNEL0 = 0,                               /*!< HPDF channel0 */
    CHANNEL1,                                   /*!< HPDF channel1 */
    CHANNEL2,                                   /*!< HPDF channel2 */
    CHANNEL3,                                   /*!< HPDF channel3 */
    CHANNEL4,                                   /*!< HPDF channel4 */
    CHANNEL5,                                   /*!< HPDF channel5 */
    CHANNEL6,                                   /*!< HPDF channel6 */
    CHANNEL7                                    /*!< HPDF channel7 */
} hpdf_channel_enum;

/* HPDF filter */
typedef enum {
    FLT0 = 0,                                   /*!< HPDF filter0 */
    FLT1,                                       /*!< HPDF filter1 */
    FLT2,                                       /*!< HPDF filter2 */
    FLT3                                        /*!< HPDF filter3 */
} hpdf_filter_enum;

/* HPDF flags */
typedef enum {
    /* flags in FLTYSTAT register */
    HPDF_FLAG_FLTY_ICEF      = HPDF_REGIDX_BIT(FLTYSTAT_REG_OFFSET, 0U),                 /*!< inserted conversion end flag */
    HPDF_FLAG_FLTY_RCEF      = HPDF_REGIDX_BIT(FLTYSTAT_REG_OFFSET, 1U),                 /*!< regular conversion end flag */
    HPDF_FLAG_FLTY_ICDOF     = HPDF_REGIDX_BIT(FLTYSTAT_REG_OFFSET, 2U),                 /*!< inserted conversion overflow flag */
    HPDF_FLAG_FLTY_RCDOF     = HPDF_REGIDX_BIT(FLTYSTAT_REG_OFFSET, 3U),                 /*!< regular conversion overflow flag */
    HPDF_FLAG_FLTY_TMEOF     = HPDF_REGIDX_BIT(FLTYSTAT_REG_OFFSET, 4U),                 /*!< threshold monitor event occurred flag */
    HPDF_FLAG_FLTY_ICPF      = HPDF_REGIDX_BIT(FLTYSTAT_REG_OFFSET, 13U),                /*!< inserted conversion in progress flag */
    HPDF_FLAG_FLTY_RCPF      = HPDF_REGIDX_BIT(FLTYSTAT_REG_OFFSET, 14U),                /*!< regular conversion in progress flag */
    HPDF_FLAG_FLT0_CKLF0     = HPDF_REGIDX_BIT(FLTYSTAT_REG_OFFSET, 16U),                /*!< clock loss on channel 0 flag */
    HPDF_FLAG_FLT0_CKLF1     = HPDF_REGIDX_BIT(FLTYSTAT_REG_OFFSET, 17U),                /*!< clock loss on channel 1 flag */
    HPDF_FLAG_FLT0_CKLF2     = HPDF_REGIDX_BIT(FLTYSTAT_REG_OFFSET, 18U),                /*!< clock loss on channel 2 flag */
    HPDF_FLAG_FLT0_CKLF3     = HPDF_REGIDX_BIT(FLTYSTAT_REG_OFFSET, 19U),                /*!< clock loss on channel 3 flag */
    HPDF_FLAG_FLT0_CKLF4     = HPDF_REGIDX_BIT(FLTYSTAT_REG_OFFSET, 20U),                /*!< clock loss on channel 4 flag */
    HPDF_FLAG_FLT0_CKLF5     = HPDF_REGIDX_BIT(FLTYSTAT_REG_OFFSET, 21U),                /*!< clock loss on channel 5 flag */
    HPDF_FLAG_FLT0_CKLF6     = HPDF_REGIDX_BIT(FLTYSTAT_REG_OFFSET, 22U),                /*!< clock loss on channel 6 flag */
    HPDF_FLAG_FLT0_CKLF7     = HPDF_REGIDX_BIT(FLTYSTAT_REG_OFFSET, 23U),                /*!< clock loss on channel 7 flag */
    HPDF_FLAG_FLT0_MMF0      = HPDF_REGIDX_BIT(FLTYSTAT_REG_OFFSET, 24U),                /*!< malfunction event occurred on channel 0 flag */
    HPDF_FLAG_FLT0_MMF1      = HPDF_REGIDX_BIT(FLTYSTAT_REG_OFFSET, 25U),                /*!< malfunction event occurred on channel 1 flag */
    HPDF_FLAG_FLT0_MMF2      = HPDF_REGIDX_BIT(FLTYSTAT_REG_OFFSET, 26U),                /*!< malfunction event occurred on channel 2 flag */
    HPDF_FLAG_FLT0_MMF3      = HPDF_REGIDX_BIT(FLTYSTAT_REG_OFFSET, 27U),                /*!< malfunction event occurred on channel 3 flag */
    HPDF_FLAG_FLT0_MMF4      = HPDF_REGIDX_BIT(FLTYSTAT_REG_OFFSET, 28U),                /*!< malfunction event occurred on channel 4 flag */
    HPDF_FLAG_FLT0_MMF5      = HPDF_REGIDX_BIT(FLTYSTAT_REG_OFFSET, 29U),                /*!< malfunction event occurred on channel 5 flag */
    HPDF_FLAG_FLT0_MMF6      = HPDF_REGIDX_BIT(FLTYSTAT_REG_OFFSET, 30U),                /*!< malfunction event occurred on channel 6 flag */
    HPDF_FLAG_FLT0_MMF7      = HPDF_REGIDX_BIT(FLTYSTAT_REG_OFFSET, 31U),                /*!< malfunction event occurred on channel 7 flag */
    /* flags in FLT0RDATA register */
    HPDF_FLAG_FLTY_RCHPDT    = HPDF_REGIDX_BIT(FLTYRDATA_REG_OFFSET, 4U),                /*!< regular channel pending data */
    /* flags in FLTYTMSTAT register */
    HPDF_FLAG_FLTY_LTF0      = HPDF_REGIDX_BIT(FLTYTMSTAT_REG_OFFSET, 0U),               /*!< threshold monitor low threshold on channel 0 flag */
    HPDF_FLAG_FLTY_LTF1      = HPDF_REGIDX_BIT(FLTYTMSTAT_REG_OFFSET, 1U),               /*!< threshold monitor low threshold on channel 1 flag */
    HPDF_FLAG_FLTY_LTF2      = HPDF_REGIDX_BIT(FLTYTMSTAT_REG_OFFSET, 2U),               /*!< threshold monitor low threshold on channel 2 flag */
    HPDF_FLAG_FLTY_LTF3      = HPDF_REGIDX_BIT(FLTYTMSTAT_REG_OFFSET, 3U),               /*!< threshold monitor low threshold on channel 3 flag */
    HPDF_FLAG_FLTY_LTF4      = HPDF_REGIDX_BIT(FLTYTMSTAT_REG_OFFSET, 4U),               /*!< threshold monitor low threshold on channel 4 flag */
    HPDF_FLAG_FLTY_LTF5      = HPDF_REGIDX_BIT(FLTYTMSTAT_REG_OFFSET, 5U),               /*!< threshold monitor low threshold on channel 5 flag */
    HPDF_FLAG_FLTY_LTF6      = HPDF_REGIDX_BIT(FLTYTMSTAT_REG_OFFSET, 6U),               /*!< threshold monitor low threshold on channel 6 flag */
    HPDF_FLAG_FLTY_LTF7      = HPDF_REGIDX_BIT(FLTYTMSTAT_REG_OFFSET, 7U),               /*!< threshold monitor low threshold on channel 7 flag */
    HPDF_FLAG_FLTY_HTF0      = HPDF_REGIDX_BIT(FLTYTMSTAT_REG_OFFSET, 8U),               /*!< threshold monitor high threshold on channel 0 flag */
    HPDF_FLAG_FLTY_HTF1      = HPDF_REGIDX_BIT(FLTYTMSTAT_REG_OFFSET, 9U),               /*!< threshold monitor high threshold on channel 1 flag */
    HPDF_FLAG_FLTY_HTF2      = HPDF_REGIDX_BIT(FLTYTMSTAT_REG_OFFSET, 10U),              /*!< threshold monitor high threshold on channel 2 flag */
    HPDF_FLAG_FLTY_HTF3      = HPDF_REGIDX_BIT(FLTYTMSTAT_REG_OFFSET, 11U),              /*!< threshold monitor high threshold on channel 3 flag */
    HPDF_FLAG_FLTY_HTF4      = HPDF_REGIDX_BIT(FLTYTMSTAT_REG_OFFSET, 12U),              /*!< threshold monitor high threshold on channel 4 flag */
    HPDF_FLAG_FLTY_HTF5      = HPDF_REGIDX_BIT(FLTYTMSTAT_REG_OFFSET, 13U),              /*!< threshold monitor high threshold on channel 5 flag */
    HPDF_FLAG_FLTY_HTF6      = HPDF_REGIDX_BIT(FLTYTMSTAT_REG_OFFSET, 14U),              /*!< threshold monitor high threshold on channel 6 flag */
    HPDF_FLAG_FLTY_HTF7      = HPDF_REGIDX_BIT(FLTYTMSTAT_REG_OFFSET, 15U)               /*!< threshold monitor high threshold on channel 7 flag */
} hpdf_flag_enum;

