RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Include/gd32h75e_hpdf.h
/* threshold monitor low threshold event break signal definitions */
#define LTBSD(regval)                   (BITS(0,1) & ((uint32_t)(regval)<< 1))          /*!< select low threshold event break signal */
#define NO_TM_LT_BREAK                  LTBSD(0)                                        /*!< break signal is not distributed to an threshold monitor low threshold event */
#define TM_LT_BREAK0                    LTBSD(1)                                        /*!< break signal 0 is distributed to an threshold monitor low threshold event */
#define TM_LT_BREAK1                    LTBSD(2)                                        /*!< break signal 1 is distributed to an threshold monitor low threshold event */
#define TM_LT_BREAK2                    LTBSD(4)                                        /*!< break signal 2 is distributed to an threshold monitor low threshold event */
#define TM_LT_BREAK3                    LTBSD(8)                                        /*!< break signal 3 is distributed to an threshold monitor low threshold event */

/* threshold monitor bypass definitions */
#define TM_FLT_BYPASS                   ((uint32_t)0x00000001U)                         /*!< the threshold monitor filter is bypassed. */

/* extremes monitor definitions */
/* extremes monitor channel definitions */
#define EMCS(regval)                    (BITS(8,15) & ((uint32_t)(regval)<< 8))         /*!< select extremes monitor channel */
#define EM_CHANNEL_DISABLE              EMCS(0)                                         /*!< extremes monitor y does not accept data from channel 0 and channel 1 */
#define EM_CHANNEL0                     EMCS(0x01)                                      /*!< extremes monitor y accepts data from channel 0 */
#define EM_CHANNEL1                     EMCS(0x02)                                      /*!< extremes monitor y accepts data from channel 1 */
#define EM_CHANNEL2                     EMCS(0x04)                                      /*!< extremes monitor y accepts data from channel 2 */
#define EM_CHANNEL3                     EMCS(0x08)                                      /*!< extremes monitor y accepts data from channel 3 */
#define EM_CHANNEL4                     EMCS(0x10)                                      /*!< extremes monitor y accepts data from channel 4 */
#define EM_CHANNEL5                     EMCS(0x20)                                      /*!< extremes monitor y accepts data from channel 5 */
#define EM_CHANNEL6                     EMCS(0x40)                                      /*!< extremes monitor y accepts data from channel 6 */
#define EM_CHANNEL7                     EMCS(0x80)                                      /*!< extremes monitor y accepts data from channel 7 */

/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT
/* check HPDFCLK source */
#define NOT_HPDFCLK_SOURCE(source)                               (((source) != SERIAL_SYSTEM_CLK) && ((source) != SERIAL_AUDIO_CLK))

/* check HPDF ckout mode */
#define NOT_CKOUT_MOD(mode)                                      (((mode) != CKOUTDM_DISABLE) && ((mode) != CKOUTDM_ENABLE))

/* check HPDF SPI clock source */
#define NOT_SPICLOCK_SOURCE(clock_source)                        (((clock_source) != EXTERNAL_CKIN) && ((clock_source) != INTERNAL_CKOUT) && \
                                                                 ((clock_source) != HALF_CKOUT_FALLING_EDGE) && ((clock_source) != HALF_CKOUT_RISING_EDGE))                                                         

/* check HPDF serial interface type */
#define NOT_SERIALIF_TYPE(type)                                  (((type) != SPI_RISING_EDGE) && ((type) != SPI_FALLING_EDGE) && \
                                                                 ((type) != MANCHESTER_CODE0) && ((type) != MANCHESTER_CODE1))

/* check input data source */
#define NOT_INPUT_DATA_SOURCE(data_source)                       (((data_source) != SERIAL_INPUT) && ((data_source) != ADC_INPUT) && ((data_source) != INTERNAL_INPUT))

/* check parallel data packing mode */
#define NOT_PARA_DATA_SOURCE(data_source)                        (((data_source) != SERIAL_INPUT) && ((data_source) != ADC_INPUT) && ((data_source) != INTERNAL_INPUT))

/* check not right shift bit */
#define RIGHT_SHIFT_LOW                                          ((uint32_t)0x00000000U)
#define RIGHT_SHIFT_HIGH                                         ((uint32_t)0x0000001FU)
#define NOT_RIGHT_SHIFT(right_shift)                             (RIGHT_SHIFT_HIGH < (right_shift))

/* check 24-bit calibration offset */
#define CALI_OFFSET_LOW                                          ((int32_t)-8388608)
#define CALI_OFFSET_HIGH                                         ((int32_t)8388607)
#define NOT_CALI_OFFSET(offset)                                  ((CALI_OFFSET_HIGH < (offset)) && ((offset) < CALI_OFFSET_LOW))

/* check malfunction monitor break signal */
#define NOT_MM_BREAK_SIGNAL(break_signal)                        (((break_signal) != NO_MM_BREAK) && ((break_signal) != MM_BREAK0) && \
                                                                 ((break_signal) != MM_BREAK1) && ((break_signal) != MM_BREAK2) && \
                                                                 ((break_signal) != MM_BREAK3))

/* check data packing mode */
#define NOT_PARADATA_PACK_MOD(mode)                              (((mode) != DPM_STANDARD_MODE) && ((mode) != DPM_INTERLEAVED_MODE) && ((mode) != DPM_DUAL_MODE))

/* check malfunction monitor counter threshold */
#define COUNT_THRESHOLD_LOW                                      ((uint32_t)0x00000000U)
#define COUNT_THRESHOLD_HIGH                                     ((uint32_t)0x0000001FU)
#define NOT_COUNT_THRESHOLD(threshold)                           (COUNT_THRESHOLD_HIGH < (threshold))

/* sinc filter order */
#define NOT_FILTER_ORDER(order)                                  (((order) != FLT_FASTSINC) && ((order) != FLT_SINC1) && \
                                                                 ((order) != FLT_SINC2) && ((order) != FLT_SINC3) && \
                                                                 ((order) != FLT_SINC4) && ((order) != FLT_SINC5))               

/* check Sinc filter oversampling rate */
#define OVERSAMPLE_LOW                                           ((uint32_t)0x00000001U)
#define OVERSAMPLE_HIGH                                          ((uint32_t)0x00000400U)
#define NOT_OVERSAMPLE(oversample)                               ((OVERSAMPLE_HIGH < (oversample)) && ((oversample) == 0U))

/* check Sinc filter oversampling rate */
#define INTER_OVERSAMPLE_LOW                                     ((uint32_t)0x00000001U)
#define INTER_OVERSAMPLE_HIGH                                    ((uint32_t)0x00000100U)
#define NOT_INTER_OVERSAMPLE(oversample)                         ((INTER_OVERSAMPLE_HIGH < (oversample)) && ((oversample) == 0U))

/* sinc filter order */
#define NOT_TM_ORDER(order)                                      (((order) != TM_FASTSINC) && ((order) != TM_SINC1) && \
                                                                 ((order) != TM_SINC2) && ((order) != TM_SINC3))

/* check Sinc filter oversampling rate */
#define TM_OVERSAMPLE_LOW                                        ((uint32_t)0x00000001U)
#define TM_OVERSAMPLE_HIGH                                       ((uint32_t)0x00000020U)
#define NOT_TM_OVERSAMPLE(oversample)                            ((TM_OVERSAMPLE_HIGH < (oversample)) && ((oversample) == 0U ))

