RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Include/gd32h75e_hpdf.h
/* check threshold monitor channel */
#define NOT_TM_CHANNEL(channel)                                  (((channel) != TMCHEN_DISABLE) && ((channel) != TMCHEN_CHANNEL0) && \
                                                                 ((channel) != TMCHEN_CHANNEL1) && ((channel) != TMCHEN_CHANNEL2) && \
                                                                 ((channel) != TMCHEN_CHANNEL3) && ((channel) != TMCHEN_CHANNEL4) && \
                                                                 ((channel) != TMCHEN_CHANNEL5) && ((channel) != TMCHEN_CHANNEL6) && \
                                                                 ((channel) != TMCHEN_CHANNEL7))   

/* check high threshold value */
#define TM_VALUE_LOW                                             ((int32_t)0x00800000U)
#define TM_VALUE_HIGH                                            ((int32_t)0x007FFFFFU)
#define NOT_TM_VALUE(value)                                      ((TM_VALUE_HIGH < (value)) && ((value) < TM_VALUE_LOW))

/* check HPDF break signal */
#define NOT_TM_BREAK_SIGNAL(break_signal)                        (((break_signal) != NO_TM_HT_BREAK) && ((break_signal) != TM_HT_BREAK0) && \
                                                                 ((break_signal) != TM_HT_BREAK1) && ((break_signal) != TM_HT_BREAK2) && \
                                                                 ((break_signal) != TM_HT_BREAK3))   

/* check extremes monitor channel */
#define NOT_EM_CHANNEL(channel)                                  (((channel) != EM_CHANNEL_DISABLE) && ((channel) != EM_CHANNEL0) && \
                                                                 ((channel) != EM_CHANNEL1) && ((channel) != EM_CHANNEL2) && \
                                                                 ((channel) != EM_CHANNEL3) && ((channel) != EM_CHANNEL4) && \
                                                                 ((channel) != EM_CHANNEL5) && ((channel) != EM_CHANNEL6) && \
                                                                 ((channel) != EM_CHANNEL7))   

/* check regular conversion channel selection */
#define NOT_RCS_CHANNEL(channel)                                 (((channel) != RCS_CHANNEL0) && ((channel) != RCS_CHANNEL1) && \
                                                                 ((channel) != RCS_CHANNEL2) && ((channel) != RCS_CHANNEL3) && \
                                                                 ((channel) != RCS_CHANNEL4) && ((channel) != RCS_CHANNEL5) && \
                                                                 ((channel) != RCS_CHANNEL6) && ((channel) != RCS_CHANNEL7))  

/* check inserted conversions trigger signal */
#define NOT_IC_TRIG(trigger)                                     (((trigger) != HPDF_ITRG0) && ((trigger) != HPDF_ITRG1) && \
                                                                 ((trigger) != HPDF_ITRG2) && ((trigger) != HPDF_ITRG3) && \
                                                                 ((trigger) != HPDF_ITRG4) && ((trigger) != HPDF_ITRG5) && \
                                                                 ((trigger) != HPDF_ITRG6) && ((trigger) != HPDF_ITRG7) && \
                                                                 ((trigger) != HPDF_ITRG8) && ((trigger) != HPDF_ITRG11) && \
                                                                 ((trigger) != HPDF_ITRG12) && ((trigger) != HPDF_ITRG24) && \
                                                                 ((trigger) != HPDF_ITRG25) && ((trigger) != HPDF_ITRG31))  

/* check inserted conversions trigger edge */
#define NOT_IC_TRIG_EDGE(trigger_edge)                           (((trigger_edge) != TRG_DISABLE) && ((trigger) != RISING_EDGE_TRG) && \
                                                                 ((trigger_edge) != FALLING_EDGE_TRG) && ((trigger) != EDGE_TRG)) 

/* check inserted group channel */
#define NOT_ICS_CHANNEL(channel)                                 (((channel) != ICGSEL_CHANNEL0) && ((channel) != ICGSEL_CHANNEL1) && \
                                                                 ((channel) != ICGSEL_CHANNEL2) && ((channel) != ICGSEL_CHANNEL3) && \
                                                                 ((channel) != ICGSEL_CHANNEL4) && ((channel) != ICGSEL_CHANNEL5) && \
                                                                 ((channel) != ICGSEL_CHANNEL6) && ((channel) != ICGSEL_CHANNEL7))  
#endif /* FW_DEBUG_ERR_REPORT */

/* function declarations */
/* initialize HPDF channel and filter registers */
/* reset HPDF */
void hpdf_deinit(void);
/* initialize the parameters of HPDF channel struct with the default values */
void hpdf_channel_struct_para_init(hpdf_channel_parameter_struct *init_struct);
/* initialize the parameters of HPDF filter struct with the default values */
void hpdf_filter_struct_para_init(hpdf_filter_parameter_struct *init_struct);
/* initialize the parameters of regular conversion struct with the default values */
void hpdf_rc_struct_para_init(hpdf_rc_parameter_struct *init_struct);
/* initialize the parameters of inserted conversion struct with the default values */
void hpdf_ic_struct_para_init(hpdf_ic_parameter_struct *init_struct);
/* enable the HPDF module globally */
void hpdf_enable(void);
/* disable the HPDF module globally */
void hpdf_disable(void);
/* initialize the HPDF channel */
void hpdf_channel_init(hpdf_channel_enum channelx, hpdf_channel_parameter_struct *init_struct);
/* initialize the HPDF filter */
void hpdf_filter_init(hpdf_filter_enum filtery, hpdf_filter_parameter_struct *init_struct);
/* initialize the regular conversion */
void hpdf_rc_init(hpdf_filter_enum filtery, hpdf_rc_parameter_struct *init_struct);
/* initialize the inserted conversion */
void hpdf_ic_init(hpdf_filter_enum filtery, hpdf_ic_parameter_struct *init_struct);

/* configure the HPDF clock output */
/* configure serial output clock */
void hpdf_clock_output_config(uint32_t source, uint8_t divider, uint32_t mode);
/* configure serial clock output source */
void hpdf_clock_output_source_config(uint32_t source);
/* disable serial clock output duty mode */
void hpdf_clock_output_duty_mode_disable(void);
/* enable serial clock output duty mode */
void hpdf_clock_output_duty_mode_enable(void);
/* configure serial clock output divider */
void hpdf_clock_output_divider_config(uint8_t divider);

